app/views/words/activateUsers.html.haml

SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---

-# - @word= Word.find(1)