app/views/words/addWord.html.haml

SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 65], ["LIMIT", 1]]
---
%div.update
	- word = Word.find(1)