app/controllers/words_controller.rb

SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 65], ["LIMIT", 1]]
---
	def addWord
		@data = Word.find(params[:id])