app/controllers/words_controller.rb

SELECT  "words".* FROM "words" ORDER BY "words"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
	def show
		@lang = session[:lang] || params[:lang] || "spanish"

		@list = Word.all;

SELECT "words".* FROM "words"
---
	def allWords
		@lang = session[:lang] || params[:lang] || "spanish"

		@list = Word.all;