app/controllers/words_controller.rb

	def activate
		puts "**********"
		# puts params[:user]['activated']
		puts "**********"

		if request.post?
			# get user
			# I have to remove this code to the model I am breaking MVC here
			_activated = params[:user]['activated'];
			user = User.find(params[:id]);

			user.update(activated: _activated)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "activated" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["activated", "t"], ["updated_at", "2018-03-02 07:09:43.299311"], ["id", 2]]

	def update
		id = params[:id]
		@word = Word.find(id)

		if request.post?
			wordsArr = params[:word]
			spanish = wordsArr['spanish']
			zapoteco = wordsArr['zapoteco']
			english = wordsArr['word']

			@word.update(word: english)
---
SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "words" SET "word" = ?, "updated_at" = ? WHERE "words"."id" = ?  [["word", "Hello this is the word"], ["updated_at", "2018-03-04 07:25:13.683560"], ["id", 1]]

	def activateUsers
		@users = User.all;
---
SELECT "users".* FROM "users"

	def create
		# byebug

		# english = params[:english]
		# spanish = params[:spanish]
		# zapoteco = params[:zapoteco]

		english = params[:word][:word]
		spanish = params[:word][:spanish]
		zapoteco = params[:word][:zapoteco]
		category = "cats"

		Word.create(word: english, spanish: spanish, zapoteco: zapoteco, category: category)
---
INSERT INTO "words" ("word", "category", "created_at", "updated_at", "spanish", "zapoteco") VALUES (?, ?, ?, ?, ?, ?)  [["word", "en"], ["category", "cats"], ["created_at", "2018-01-11 02:57:54.590483"], ["updated_at", "2018-01-11 02:57:54.590483"], ["spanish", "sp"], ["zapoteco", "za"]]